void InitRandomShipsNames()
{
	// Spain names
	int n = 0;
	n = AddStr2Array(&sRndShpSpName, n, "Адвентурия,Африка,Агвила,Амазона,Амброзия,Амфитрит,Анхель де ла Гварда,Аннунсиасион");
	n = AddStr2Array(&sRndShpSpName, n, "Аргонавт,Арроганте,Азия,Астрея,Астуто,Асунсьон,Аталанте,Атревидо,Багама,Барбара");
	n = AddStr2Array(&sRndShpSpName, n, "Болодор,Браве,Кантабро,Карлотта,Кармелита,Казодор,Церес,Чилка,Кьевра,Клара,Колон");
	n = AddStr2Array(&sRndShpSpName, n, "Концепсион,Конквистадор,Контабро,Корсо,Кубас,Куевро,Дефендуетра,Диана,Дилигенсиа");
	n = AddStr2Array(&sRndShpSpName, n, "Элизабет,Эсмеральда,Эспата,Эсперанца,Европа,Фама,Фелис,Феникс,Фирме,Флеча,Формидаль");
	n = AddStr2Array(&sRndShpSpName, n, "Фуерта,Гайлардо,Гальго,Галисиа,Гато,Гертрудиус,Глория,Глориозо,Гуереро,Гуипускано");
	n = AddStr2Array(&sRndShpSpName, n, "Хаста,Эрмангильдо,Эрмион,Инфанта,Интерпидо,Изабелла,Юно,Льебра,Лигуеро,Лигура");
	n = AddStr2Array(&sRndShpSpName, n, "Лимено,Магнанимо,Магоенца,Мария Дела,Матильда,Медея,Мерседес,Мексикано,Минерва,Миньо");
	n = AddStr2Array(&sRndShpSpName, n, "Момарка,Монтанез,Мурциано,Нативидад,Нептуно,Нинфо,Ориенте,Оркуихо,Паллас,Паксаро,Пааз");
	n = AddStr2Array(&sRndShpSpName, n, "Перивьяно,Перла,Пинта,Поли,Принцесса,Рапоза,Райо,Реал Фамилия,Рейна Луиза,Резолюсион");
	n = AddStr2Array(&sRndShpSpName, n, "Розарио,Сабина,Сан Антонио,Сан Августин,Санта Барбара,Сан Батиста,Сан Блас,Сан Бруно");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Карлос,Сан Дамазо,Сан Эугенио,Сан Фелипе,Сан Фермин,Сан Фиоренцо,Сан Франциско");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Фульгенсио,Сан Габриэль,Сан Генаро,Сан Гил,Сан Ильдефонсо,Сан Изидоро,Сан Хоаким");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Жозеф,Сан Хуан Батиста,Сан Хуан Батиста,Сан Хуан Непомуцено,Сан Хулиан,Сан Хусто");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Леонардо,Сан Леонардо,Сан Леон,Сан Лино,Сан Лоренцо,Сан Николас,Сан Пабло,Сан Паскаль");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Педро Алакантара,Сан Педро Апостал,Сан Пио,Сан Рафаэль,Сан Ромон,Сан Себастиано");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Винсенте,Сан Исидро,Сан Фелипе,Санта Агуеда,Санта Анна,Санта Бригида,Санта Каталина");
	n = AddStr2Array(&sRndShpSpName, n, "Санта Кацильда,Санта Сесилия,Санта Клара,Санта Доротея,Санта Елена,Санта Эсколостика");
	n = AddStr2Array(&sRndShpSpName, n, "Санта Флорентина,Санта Гертрудис,Санта Изабелла,Санта Леонкадия,Санта Лучия,Санта Маргаретта");
	n = AddStr2Array(&sRndShpSpName, n, "Санта Мария,Санта Мария Магдалена,Санта Матильда,Санта Перпетуа,Санта Рахель,Санта Рита");
	n = AddStr2Array(&sRndShpSpName, n, "Санта Роза,Санта Розалия,Санта Руфиния,Санта Сабина,Санта Сулалия,Санта Тереза,Сантельмо");
	n = AddStr2Array(&sRndShpSpName, n, "Секта,Серио,Сирена,Соберано,Тартар,Террибль,Тетиз,Триофанте,Труча,Вилиента,Валороза");
	n = AddStr2Array(&sRndShpSpName, n, "Веласко,Велоза,Венседор,Венганца,Венус,Винцехо,Виво,Воадер");
	n = AddStr2Array(&sRndShpSpName, n, "Веласко,Велоза,Венседор,Венганца,Венус,Винцехо,Виво,Воадер");
	n = AddStr2Array(&sRndShpSpName, n, "Веласко,Велоза,Венседор,Венганца,Венус,Винцехо,Виво,Воадер");

	// England names
	n = 0;
	n = AddStr2Array(&sRndShpEnName, n, "Абукир,Акаста,Акар,Ахилл,Акорн,Актив,Актеон,Акьют,Абамант,Адонис,Адвенчур,Эдвайс,Элус,Африка,Африкен,Агамемнон,Агрессор,Эгил");
	n = AddStr2Array(&sRndShpEnName, n, "Эльдреда,Аякс,Алакрити,Аларм,Альбан,Альбиокр,Альбион,Альцест,Альцид,Алькмен,Александр,Альфред,Альгериан,Аллемар,Аллигатор,Алонзо,Амаранте");
	n = AddStr2Array(&sRndShpEnName, n, "Амазон,Амелия,Аметист,Ампфион,Амфитрит,Анакреон,Андромеда,Ангель,Анзон,Антилопа,Аппеле,Аполло,Аквилон,Араб,Ардент,Арго,Аргонавт,Ариадна");
	n = AddStr2Array(&sRndShpEnName, n, "Ариэль,Армада,Арроган,Эроу,Артуиз,Азиа,Ассистанс,Ашуранс,Астрея,Аталанта,Атеньен,Атлас,Аудациос,Аврора,Авенгер,Авон,Баккант,Бахус");
	n = AddStr2Array(&sRndShpEnName, n, "Бадгер,Барфлер,Баросса,Базилиск,Бигль,Бедфорд,Белейсл,Беллерофонт,Беллона,Бенбоу,Беркли,Бервик,Блэк Принс,Блейк,Бланш,Бленхайм,Болд");
	n = AddStr2Array(&sRndShpEnName, n, "Боннета,Боксер,Брейв,Брезен,Бриллиант,Бриск,Бристоль,Британия,Бритон,Бразерс,Брюзер,Буцефал,Бульдог,Бастард,Батлер,Цезарь,Каледония,Калипсо");
	n = AddStr2Array(&sRndShpEnName, n, "Кембридж,Камилла,Канопус,Карнатик,Каролина,Кастор,Катерина,Цензор,Кентавр,Центурион,Церберус,Церес,Чемпион,Чарджер,Шарлот,Харон,Чероки");
	n = AddStr2Array(&sRndShpEnName, n, "Черуб,Кирке,Клементин,Клеопатра,Кокатрайс,Колоссус,Комета,Конфаундер,Конкверор,Конквест,Корбелия,Корнелия,Корнуолис,Козак,Курье,Кракер");
	n = AddStr2Array(&sRndShpEnName, n, "Креол,Крескент,Кресси,Крокодил,Краун,Кьян,Циклоп,Кигнет,Дедал,Дане,Даннемарк,Дафна,Даринг,Даше,Дашильд,Декой,Дефенс,Дефианс,Дезире");
	n = AddStr2Array(&sRndShpEnName, n, "Десперейт,Диадема,Диамонд,Диана,Диктатор,Дидо,Дилиджент,Диомед,Директор,Дискавери,Дельфин,Дорис,Дракон,Дрейк,Дредноут,Драйвер,Дромедари,Друид");
	n = AddStr2Array(&sRndShpEnName, n, "Драйд,Дублин,Дюк,Дункан,Игл,Эхо,Эклипс,Эдгар,Эгмонт,Эгиптьен,Элефант,Элизабет,Эмеральд,Энчантрес,Эндемион,Энтерпрайз,Энтепренант");
	n = AddStr2Array(&sRndShpEnName, n, "Эскорт,Эталион,Европа,Эуротас,Эуриалис,Эвридика,Экселент,Экспедишн,Эксперимент,Фейри,Фалькон,Фейм,Фаворит,Фавн,Ферре,Фирм,Флирт,Флора,Флай,Формидабль");
	n = AddStr2Array(&sRndShpEnName, n, "Фортитьюд,Фортуна,Фокс,Фоксхаунд,Фролик,Фьюри,Галатея,Галлант,Ганне,Ганимед,Гарланд,Генерал Монк,Джипси,Гладиатор,Глазго,Глори,Гольдфинч,Голиаф");
	n = AddStr2Array(&sRndShpEnName, n, "Гудли,Грампус,Грассхопер,Грейхаунд,Галифакс,Ханна-Роз,Ганнибал,Гарпия,Хейсти,Хоти,Хэйвок,Хок,Хазард,Хебе,Гектор,Элена,Геркулес,Гермес,Эрмион");
	n = AddStr2Array(&sRndShpEnName, n, "Герой, Героиня,Харон,Иберния,Хинд,Горацио,Хаунд,Гиена,Гидра,Гиперион,Иллюстриус,Имплакабль,Импрегнабль,Инконстант,Инфлексибль,Интерпид,Инвинсибль");
	n = AddStr2Array(&sRndShpEnName, n, "Ифигения,Ирис,Иррезистибль,Изида,Ясон,Юнона,Юпитер,Юсте,Кенгуру,Катерина,Кент,Кит,Лапвиг,Латона,Лавиния,Леда,Леонидас,Леопард,Левант,Левиафан");
	n = AddStr2Array(&sRndShpEnName, n, "Либерти,Лайтнинг,Лион,Литл Салли,Лайвли,Лизард,Лондон,Лидия,Линск,Лира,Македония,Магнаним,Магнифисент,Маджестик,Маринер,Маритал,Марс,Мартин,Мэри");
	n = AddStr2Array(&sRndShpEnName, n, "Медина,Медуза,Мидвей,Мелампус,Мелеагр,Мельпомена,Меркурий,Мерлин,Мермейд,Метеор,Минерва,Минотавр,Менестрель,Монарх,Мирмидон,Мулле,Мютини,Найд,Нарцисс");
	n = AddStr2Array(&sRndShpEnName, n, "Наутилус,Немезида,Нептун,Нереида,Нимбл,Немврод,Нонсач,Нимфа,Оушен,Олимпия,Опоссум,Орест,Орион,Оттер,Паллада,Пандора,Партридж,Паулетте,Пикок,Перл");
	n = AddStr2Array(&sRndShpEnName, n, "Пегас,Пеликан,Пенелопа,Персей,Персерванс,Феб,Феникс,Фаэтон,Пирсер,Пилот,Пинчер,Пионер,Пловер,Плампер,Плутон,Полифем,Пауерфул,Принц,Принцесса");
	n = AddStr2Array(&sRndShpEnName, n, "Промт,Прозерпина,Протектор,Протей,Пруден,Психея,Пигмей,Пирамус,Квин,Рацехорс,Рейнбоу,Ризон,Ризонабл,Ренджер,Раттлснейк,Реди,Ребуф,Рекавери,Редбрист");
	n = AddStr2Array(&sRndShpEnName, n, "Редпол,Регулус,Рейдер,Ренаун,Репулс,Резистанс,Ресорс,Реталяйшн,Ретрибьюшн,Реюньон,Ревендж,Революшионер,Родни,Ромни,Ромул,Роз,Ровер,Ройалист");
	n = AddStr2Array(&sRndShpEnName, n, "Рубин,Сабрина,Сандвич,Сатурн,Севедж,Скамандр,Скрепт,Сципион,Скорпион,Скурдж,Скаут,Сихорс,Семирамида,Серапис,Серпент,Шарк,Ширватер,Сэр Френсис Дрейк");
	n = AddStr2Array(&sRndShpEnName, n, "Сириус,Снейк,Спартак,Спидвел,Спиди,Спенсер,Сфинкс,Спайдер,Спитфайр,Спрайтли,Спай,Сквирел,Штаг,Стандарт,Стерлинг,Саксес,Султан,Сюрприз,Сюзан");
	n = AddStr2Array(&sRndShpEnName, n, "Сваггер,Свалоу,Сван,Свифт,Свифтшур,Сибил,Сильф,Сирен,Тартар,Тизер,Телемах,Терпсихора,Террибль,Таис,Темс,Тезей,Тетис,Тисба,Торн,Тандер");
	n = AddStr2Array(&sRndShpEnName, n, "Тиклер,Тигресс,Тремендус,Трепасси,Триал,Трибьюн,Тридент,Триммер,Тритон,Триумф,Трасти,Улисс,Андаутед,Юникорн,Юнион,Юнайт,Ургент,Валиант,Вангар,Венерабль");
	n = AddStr2Array(&sRndShpEnName, n, "Вендженс,Венера,Веста,Вестал,Ветеран,Виктор,Виктори,Вигиллан,Виндиктив,Вайпер,Виксен,Вульчур,Уориор,Варспит,Васп,Виллиам & Мэри,Вольверин,Ранлер,Зилос,Зеб");
	n = AddStr2Array(&sRndShpEnName, n, "Вендженс,Венера,Веста,Вестал,Ветеран,Виктор,Виктори,Вигиллан,Виндиктив,Вайпер,Виксен,Вульчур,Уориор,Варспит,Васп,Виллиам & Мэри,Вольверин,Ранлер,Зилос,Зеб");
	n = AddStr2Array(&sRndShpEnName, n, "Вендженс,Венера,Веста,Вестал,Ветеран,Виктор,Виктори,Вигиллан,Виндиктив,Вайпер,Виксен,Вульчур,Уориор,Варспит,Васп,Виллиам & Мэри,Вольверин,Ранлер,Зилос,Зеб");

	// France names
	n = 0;
	n = AddStr2Array(&sRndShpFrName, n, "Абьель,Ашанте,Ахилл,Актиф,Aэлькон,Африкэн,Агриколь,Эгле,Аякс,Алкеста,Алкид,Алерте,Александре,Аллгесирас,Алюетт,Амарант,Амазонка,Амбюскад,Америк,Андромаха,Аннибал");
	n = AddStr2Array(&sRndShpFrName, n, "Антилопа,Аполлон,Аквилон,Ардент,Аретуза,Аргонавт,Ариэль,Артемида,Артезин,Астри,Атланте,Атлас,Август,Аврора,Бабет,Бадин,Байонес,Белле,Белиль,Беллона");
	n = AddStr2Array(&sRndShpFrName, n, "Берцау,Бервик,Бестал,Бетсей,Бизаре,Бланке,Бленвен,Блонде,Болонтайр,Бонне,Ситоен,Борей,Будуес,Будисан,Бурдонесс,Бургонье,Браве,Бравурин,Бресло,Бриллиант");
	n = AddStr2Array(&sRndShpFrName, n, "Бруне,Брут,Буцентавр,Каира,Каллиопа,Каллипсо,Каприз,Кармагнол,Каролина,Картагенез,Кассар,Кастор,Цензор,Центор,Церес,Шаме,Шарент,Шери,Шифон");
	n = AddStr2Array(&sRndShpFrName, n, "Кисалпин,Китоен,Клеопатра,Клоринд,Кокад,Комерс де Бордеакс,Комерс де Марсильез,Конкорд,Конфианс,Конфиант,Конкверант,Консолант,Констанс,Конститьен,Конвентьон");
	n = AddStr2Array(&sRndShpFrName, n, "Коквуель,Кормагноль,Корнель,Корнет,Курьер,Кот Д'Ивуар,Курагес,Курьер,Корона,Кретен,Курлейс,Сибел,Дане,Дасаи,Дофин Ройаль,Декада,Десиус,Десиус,Дегайнес,Дезире");
	n = AddStr2Array(&sRndShpFrName, n, "Дезире,Дестин,Диадема,Диана,Дидон,Дилигент,Дикс Аут,Дриада,Дюк де Бургунь,Дюгей Труан,Дулис,Дюкуесне,Дюранс,Дюрас,Эхле,Эклер,Эгиптьен");
	n = AddStr2Array(&sRndShpFrName, n, "Электра,Элизабет,Элиза,Эмброй,Эмерад,Эмулус,Энхантресс,Энгагуант,Энтрепренант,Эоле,Эперьве,Эсперанс,Эспион,Этуаль,Эвелин,Фантом,Фувет,Фее,Фелесите,Фендан,Фидель,Флибустьер");
	n = AddStr2Array(&sRndShpFrName, n, "Файн,Фламанд,Флехе,Флерон,Флора,Формидабль,Форте,Фортуна,Фудрайант,Фогуакс,Франклин,Фратерните,Фрипон,Фуре,Фурьоз,Галатея,Гаспар,Женере,Жентиль,Глур,Глорье,Грасуаз");
	n = AddStr2Array(&sRndShpFrName, n, "Грани,Гваделупа,Курьер,Гуиламу,Тель,Ганибаль,Гарди,Гассард,Гектор,Гея,Елена,Геркулес,Эрмоин,Эро,Эуре,Айрондель,Оке,Эрмоин,Эврий,Иллюстр,Иматьен,Имморталите,Империал");
	n = AddStr2Array(&sRndShpFrName, n, "Имперуа,Импетуакс,Инкони,Инконстати,Инкорупте,Индиен,Индифисибле,Индомптабле,Инсолант,Инсургент,Интерпид,Инвинсибль,Ифигения,Ирида,Жакобин,Хена,Юнона,Юпитер,Жусте,Жустин");
	n = AddStr2Array(&sRndShpFrName, n, "Джустин,Латона,Легере,Леопард,Леврире,Либерте,Либре,Лион,Лоире,Л'Ориент,Лютине,Магнаниме,Манифик,Майда,Мажесте,Малисьез,Мара,Маренго,Март,Медея,Медуза,Мельпомена,Меркурий");
	n = AddStr2Array(&sRndShpFrName, n, "Миньон,Минерва,Минотавр,Модест,Монбланк,Монтань,Мозелле,Микиус,Мулет,Муза,Мутине,Немезида,Нептун,Нереида,Неман,Нимфа,Океан,Ориент,Орион,Паллада,Пальмира");
	n = AddStr2Array(&sRndShpFrName, n, "Папиллон,Патриот,Паулете,Пегас,Пеллетир,Пенси,Пердрикс,Перле,Перте,Петайт Аврора,Фоцион,Пик,Плутон,Помона,Помпея,Пулет,Персьез,Пренос,Превойант,Промте,Прозелит,Пресперин");
	n = AddStr2Array(&sRndShpFrName, n, "Протектер,Пруденте,Пуизан,Рейлруар,Рейллез,Рапид,Ребекка,Реклюзе,Редутабле,Рефле,Регенере,Реноме,Репризаль,Рекуин,Резистанс,Резолю,Резолюсьон,Реюнион,Реванш,Ревенж,Риволи");
	n = AddStr2Array(&sRndShpFrName, n, "Робусте,Романи,Русуа,Рояль Сезар,Русе,Сагеси,Сент Этьен,Саламин,Сардиния,Сцевала,Скипетр,Сципион,Седуизан,Сейн,Семилан,Сенсибль,Серпен,Север,Синсер,Синге,Спартиат,Сфинкс");
	n = AddStr2Array(&sRndShpFrName, n, "Cент Эсприт,Сент Мишель,Суфисан,Суфрен,Сутан,Султан,Суперби,Суперриор,Сурвелианте,Свифсюр,Сибилле,Сирене,Тактик,Тамиз,Тапагуаз,Топаз,Тартюф,Терибль,Тетис,Тигр,Тимолеон");
	n = AddStr2Array(&sRndShpFrName, n, "Тонант,Тонере,Тортуга,Тортуэреле,Турвиль,Траян,Трампуаз,Трибун,Триколор,Тридент,Триумфант,Тюранисиде,Уните,Уран,Виланте,Варсови,Венди,Венгуанс,Венгер,Вентурер");
	n = AddStr2Array(&sRndShpFrName, n, "Венера,Верту,Вестал,Везувий,Виктор,Викториоз,Вимериа,Виржин,Вирту,Вулкан,Ваграм,Ватигнис,Зефир");
	n = AddStr2Array(&sRndShpFrName, n, "Венера,Верту,Вестал,Везувий,Виктор,Викториоз,Вимериа,Виржин,Вирту,Вулкан,Ваграм,Ватигнис,Зефир");
	n = AddStr2Array(&sRndShpFrName, n, "Венера,Верту,Вестал,Везувий,Виктор,Викториоз,Вимериа,Виржин,Вирту,Вулкан,Ваграм,Ватигнис,Зефир");


	// Pirate names
	n = 0;
	n = AddStr2Array(&sRndShpPiName, n, "Остерго,Оверджсэл,Плутон,Принц Фредерик,Принц Морис,Революте,Роттердам,Шрикфервеккер,Утрехт,Фервахтинг,Вассенаар,Вестерго,Вестфризланд,Зиланд,Зевенвольдер,Зюйд Бевеланд,Нассау,Принцесса Луиза");
	n = AddStr2Array(&sRndShpPiName, n, "Папилон,Патриот,Паулете,Пегас,Пелетир,Пенси,Пердрикс,Перле,Перте,Петите Ауроре,Фоцион,Пикву,Плутон,Помона,Помпи,Поулете,Прецис,Пренойс,Превоянт,Промпте,Проселит,Прозерпина");
	n = AddStr2Array(&sRndShpPiName, n, "Сириус,Снейк,Солитаир,Спартан,Спидвил,Спиди,Спенсер,Сфинкс,Спайдер,Спитфайр,Спрайгтли,Спай,Скварел,Стаг,Стандард,Стерлинг,Саксес,Султан,Сюрприз,Сюзан");
	n = AddStr2Array(&sRndShpPiName, n, "Веласко,Велоза,Венцедор,Фенганца,Венус,Винцеджо,Виво,Воадер");
	n = AddStr2Array(&sRndShpPiName, n, "Веласко,Велоза,Венцедор,Фенганца,Венус,Винцеджо,Виво,Воадер");
	n = AddStr2Array(&sRndShpPiName, n, "Веласко,Велоза,Венцедор,Фенганца,Венус,Винцеджо,Виво,Воадер");

	// Holland names
	n = 0;
	n = AddStr2Array(&sRndShpHoName, n, "Адмирал Генер,Амстердам,Бриг Ван Лейден,Брутус,Като,Фризланд,Юпитер,Маас,Нептун,Принц Морис,Принц Виллен,Штад ен Ланд,Штатен Генераал,Врийхайд,Вокзамхайд,Вашингтон,Виллен И,Вильям Эерст");
	n = AddStr2Array(&sRndShpHoName, n, "Врекер,Зевен Провинцес,Адмирал Рюйтер,Адмирал Трек Хидес де Вриес,Амстердам,Бато,Цербер,Деврис,Дордрехт,Гельдерланд,Геликхайд,Гаарлем,Геркулес,Херстеллер,Голандия,Хуп,Картенаер,Лейден,Ноард Голланд");
	n = AddStr2Array(&sRndShpHoName, n, "Остерго,Оверийсел,Плуто,Принц Фредерик,Принц Мауртис,Революте,Роттердам,Шрикфервекер,Утрехт,Фервахтинг,Васенар,Вестерго,Вестфрисланд,Зиланд,Цевенвальдер,Цевенвольдер,Зюйд Бевеланд,Насау,Принцесса Луиза");
	n = AddStr2Array(&sRndShpHoName, n, "Принцесса Мария Луиза,Адмирал МХ Тромп,Адмирал Пит Хайн,Алькмар,Арвеприас,Батавир,Бешермер,Бракель,Брудершап,Дельфт,Эрфприн,Гленторст,Гус,Кронпринц Виллен,Насау Вайлберг,Алькмар,Белфт,Бешермер,Бракель");
	n = AddStr2Array(&sRndShpHoName, n, "Центарус,Роттердам,Шидам,Адмирал ван Тромп,Арвеприас,Гленторст,Кронпринц Виллен,Насау Вайлберг,Риджуланд,Ван Гус,Марс,Амфитрит,Арго,Белле Антуанете,Блойс,Кастор,Конститу,Дойф,Экспидит,Фемикс,Гектор,Ландискрун");
	n = AddStr2Array(&sRndShpHoName, n, "Мунисккендам,Ури,Цайдервелд,Цвитен,Амфитрит,Браве,Кастор,Эндрахт,Харлинген,Медеа,Моникендам,Паллукс,Тален,Фиктер,Аллианте,Амазон,Амфитрит,Андромах,Аремд,Арго,Асемда,Белона,Бефервийк,Кастор,Церес,Эенсгецинхайд");
	n = AddStr2Array(&sRndShpHoName, n, "Эрфпринц ван Брусвейк,Феникс,Фури,Геенгецинхайд,Джагер,Язон,Юно,Марс,Медемблик,Миделбург,Фоэникс,Цефир,Амбускад,Гедлен,Просерпин,Аларме,Алезеа,Беллона,Бриль,Дирен,Долфин,Драк,Энкуцен,Хавик,Курис,Леопард,Минерва");
	n = AddStr2Array(&sRndShpHoName, n, "Негаления,Паллас,Сципио,Сирена,Тетис,Тритон,Фалк,Венус,Вакзамхайд,Валхерен,Зипард,Хура,Оранйезал,Аякс,Атлант,Авонтурьер,Комит,Дафне,Эхо,Галатея,Гипоменес,Кемпхун,Меркур,Пайладес,Самбранг,Снойвбилд,Суринам,Аллианте");
	n = AddStr2Array(&sRndShpHoName, n, "Эспион,Галати,Масниф,Мермин,Пиджл,Зихана,Цулфелар,Браак,Хуп,Мария Луиза,Пантер,Стар,Цироб,Аякс,Харлинген,Джагер,Шнелхайд,Гир,Батуф,Бельгика,Линк,Флюгхайд,Цимив,Дирен,Марапин,Альфа,Дорис,Анабел,Цесира,Элиз,Наида");
	n = AddStr2Array(&sRndShpHoName, n, "Белле,Эсме,Алетея,Малдер,Афа,Питерсзун,Галатея,Равестейн,Белле,Эхо,Фера,Камео,Диана,Дидж,Хелвиг,Кнол,Флюгхайд,Мария,Аякс,Гел,Лиза,Муг,Опал,Садхи,Фенус,Сайбил,Кремерс,Лексиа,Дафна");
	n = AddStr2Array(&sRndShpHoName, n, "Белле,Эсме,Алетея,Малдер,Афа,Питерсзун,Галатея,Равестейн,Белле,Эхо,Фера,Камео,Диана,Дидж,Хелвиг,Кнол,Флюгхайд,Мария,Аякс,Гел,Лиза,Муг,Опал,Садхи,Фенус,Сайбил,Кремерс,Лексиа,Дафна");
	n = AddStr2Array(&sRndShpHoName, n, "Белле,Эсме,Алетея,Малдер,Афа,Питерсзун,Галатея,Равестейн,Белле,Эхо,Фера,Камео,Диана,Дидж,Хелвиг,Кнол,Флюгхайд,Мария,Аякс,Гел,Лиза,Муг,Опал,Садхи,Фенус,Сайбил,Кремерс,Лексиа,Дафна");

	// Portugal names
	n = 0;
	n = AddStr2Array(&sRndShpPoName, n, "На Са де Консейсао,Принципе Реал,Конде Дом Хенрик,Мария И,Медуза,Принцесса де Байра,Принципе Регенте,Райнха да Португаль,Сан Антонио э Сан Джос,Васко да Гамма,Альфонсо да Альбукерке,Дон Джоао де Кастро");
	n = AddStr2Array(&sRndShpPoName, n, "Инфанте дон Педро,На Са де Беллем,На Са де Бом Суцесо,Мартин де Фрайтас,Сан Себастао,Феникс,Граца,Амазана,Минерва,Принцесса Шарлота,Перола,Приципе де Бразиль,Тритао,Больфино,Улиссес,Урания,Цисне");
	n = AddStr2Array(&sRndShpPoName, n, "Принцесса де Бразил,Тетис,Торта,Венус,Джозефа,Сан Антонио э Азиа Фелис,Бенжамин,Принцесса Реал,Сан Джоао Магнанимо,Кондеса де Резонде,Сан Антонио,Аква,Глория,Нептуно,Полифемо,Валкао,Гиавота,Лебре");
	n = AddStr2Array(&sRndShpPoName, n, "Сем Номе,Серпенте де Мар,Воадор,Галго,Винганца,Аморале,Куриоза,Короа,Принцесса,Принципе,Изабел,Костанца,Лаокадия,Тарея,Тина-Мария,Геленик,Марта-Александра,Дорес,Алдонца,Джозефа,Виоланта,Лючиана");
	n = AddStr2Array(&sRndShpPoName, n, "Бетриз,Этелвина,Мария-Августа,Сониа,Белла,Фернанда,Гуиомар,Майгуина,Тереза");
	n = AddStr2Array(&sRndShpPoName, n, "Бетриз,Этелвина,Мария-Августа,Сониа,Белла,Фернанда,Гуиомар,Майгуина,Тереза");
	n = AddStr2Array(&sRndShpPoName, n, "Бетриз,Этелвина,Мария-Августа,Сониа,Белла,Фернанда,Гуиомар,Майгуина,Тереза");
}