string DLG_TEXT[12] = {       
"Добрый день, молодой человек.",
"Добрый день. Один моряк сказал, что вы знаете очень много о корабле 'Черная Жемчужина'",
"Да, он не соврал вам. Мне посчастливилось плавать на этом корабле. Но много лет назад, когда я был на 'Черной Жемчужине', произошла история, которая навсегда отвадила меня от моря\n С тех пор как я покинул 'Черную Жемчужину', я веду спокойный, тихий образ жизни.",
"Что произошло?",
"'Черная Жемчужина' всегда была пиратским кораблем. Однажды нашей команде удалось захватить большую добычу - корабль, трюмы которого были набиты золотом\n Золота было так много, что мы тратили его без оглядки. Среди всех сокровищ был сундучок с золотыми монетками\n Я не помню, как мы потратили эти деньги - я думаю, мы даже не обратили на эти монетки особого внимания. Но я думаю, это золото видело много человеческой жестокости, много жизней окончилось до срока из-за этих монет, и поэтому это сокровище стало проклятым.",
"...",
"Вскоре мы перестали доверять друг другу, затем в команде начались убийства\n Некоторые из нас были убиты, я с несколькими моими товарищами был высажен на необитаемом острове\n Те, кто остались на корабле, приняли на себя адское проклятие.  \n Они стали ходячими мертвецами - днем они выглядят как обычные люди, а ночью превращаются в скелетов. Ни пуля, ни сталь не могут причинить им вреда, они мечтали бы умереть, но их грехи и проклятие не пускают их.",
"Да, я видел этих людей.",
"Единственный способ для них обрести покой - вернуть проклятые монетки. Но это непросто сделать - золото разошлось по архипелагу\n Но ничто не может остановить моряков 'Черной жемчужины' в погоне за этими монетами\n И если это золото попадет к вам - знайте, что живые скелеты будут преследовать вас везде.",
"Какая интересная история!",
"С тех пор, как я увидел ад, я больше не брался за оружие и завязал с грабежом\n Я стал набожным человеком, я часто хожу в церковь и читаю Библию. Советую вам последовать моему примеру.",
"Спасибо за совет, но не время сейчас складывать оружие. До свидания.",

};
