string DLG_TEXT[14] = {       
"Да?",
"...",
"Вы принесли весть от Учителя? Он говорил, что пришлет своих людей.",
"Да, я от Учителя, только, может быть, ты не будешь орать об этом на всю улицу, сосунок?",
"О! От Учителя!  Я так и знал! Ой, извините, конечно, я буду потише. А где ваш медальон?",
"Ага, все-таки вспомнил о нем, а то прыгаешь, как щенок, забыл обо всем. Вот он, медальон.",
"О! Я так и знал, что это вы! Тогда я побегу скажу остальным. Мы когда отплываем?",
"Отплываем? Все-то ты знаешь. Может быть, даже знаешь куда?",
"Нет, Учитель нам не сказал.",
"Это хорошо - нечего вам знать пока еще такие вещи, а то разболтаете кому ни попадя. А где сам Учитель? Без него мы никуда не отплывем.",
"Он говорил, что отправится на Оксбэй на несколько дней. Правда, должен был вернуться еще вчера, а его до сих пор нет.",
"Странно. Тогда, думаю, что наше плавание откладывается.",
"Как? Почему?",
"Неужели ты думаешь, что мы поплывем без него? Сначала мне нужно узнать, что с ним случилось, и только тогда мы отправимся в путь.",

};
