string DLG_TEXT[12] = {       
"За работу! Нечего тут прохлаждаться!",
"...",
"Эй! Ты чего тут прохлаждаешься? За работу, падаль!",
"Это ты мне? Так я, к твоему сведению, не падаль, а капитан.",
"Ты? Капитан? Да тебя к кораблю не подпустят близко! За работу, кому сказал!",
"Ты хочешь проверить, могу ли я управлять кораблем?",
"Нет! Ну вы слышали? Эта шваль спрашивает меня, хочу ли я проверить его! Я тебя сейчас так проверю!",
"Ты уверен, что хочешь этого? Я состою на службе Англии, и выполняю поручения самого губернатора.",
"Хм... Ладно, за работу, а я сообщу, кому следует, может ты и не шутишь.",
"И побыстрее давай, у меня нет никакого желания надолго остаться в этой клоаке.",
"Ты, я смотрю, строптивый! Ничего, скоро от твоей строптивости ничего не останется.",
"Посмотрим!",

};
